/*int day;
Console.Write("Введите номер дня недели: ");
day = Convert.ToInt32(Console.ReadLine());

if (day == 1){
    Console.WriteLine("Понедельник");
}
else if(day == 2){
    Console.WriteLine("Вторник");
}
else if(day == 3){
    Console.WriteLine("Среда");
}
else if(day == 4){
    Console.WriteLine("Четверг");
}
else if(day == 5){
    Console.WriteLine("Пятница");
}
else if(day == 6){
    Console.WriteLine("Суббота");
}
else if(day == 7){
    Console.WriteLine("Воскресенье");
}
else{
    Console.WriteLine("Some thing");
}
*/

//Напишите программу, которая на вход принимает одно число (N), 
//а на выходе показывает все целые числа в промежутке от -N до N.

/*int num;

Console.Write("Введите число: ");
num = Convert.ToInt32(Console.ReadLine());

int current = num * (-1);

while(current<=num){
    Console.Write(current + " ");
    current++;
}
*/





